InformationRegisters/доп_БитфонНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>доп_БитфонНастройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрофильНастроек</Name>
					<Type>
						<v8:Type>cfg:EnumRef.доп_ПрофилиНастроекБИТPhone</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПрокси</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CallerID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IDАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Протокол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.доп_Протоколы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнтервалПеререгистрации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоопределениеNAT</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерФакса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДиректорияЗаписанныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФорматЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.доп_ФорматЗаписи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомандаПереадресации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГлубинаИсторииЗвонков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрефиксВыходаНаВнешнююЛинию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПрямойНабор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьКомандуНеБеспокоитьНаАТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомандаНеБеспокоить</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомандаОтменаНеБеспокоить</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимНеБеспокоить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверЛицензийВерсия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверЛицензийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверЛицензийПорт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверЛицензийНеИспользоватьПрокси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверЛицензийCID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоздаватьСобытиеПриВходящемЗвонке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоздаватьСобытиеПриИсходящемЗвонке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоздаватьСобытияПриВнутреннихЗвонках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВсегдаЗаписыватьРазговор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолучатьЗаписиРазговоровСБИТАТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.доп_ТелефонныеСтанцииБитАТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОтправкаСМСЛогин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОтправкаСМСПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОтправкаСМСОтправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньЛоггирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСтационарныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИспользоватьСтационарныйТелефон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтозапускПриСтартеСистемы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазворачиватьОкноПриВходящемЗвонке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткрыватьКартуЯндексПриВходящемЗвонке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредлагатьСохранитьНеизвестныйНомер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолучениеСтатусов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИскатьКонтрагента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоискДублей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТипПриемаЗвонка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.доп_УдалитьТипПриемаЗвонка</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПереводаЗвонка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.доп_ТипПереводаЗвонка</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверкаСтатусаНомераПередПереводом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриниматьНесколькоВходящих</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьОтклоненныйПриРазговореВходящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RTPПорт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДетекторАктивностиМикрофона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписокКодеков</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстройствоВыводаЗвукаВходящегоЗвонка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипВходящегоЗвонка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФайлВходящегоЗвонка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешенныйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияСофтфона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/доп_ФорматЗаписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>доп_ФорматЗаписи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>wav</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>mp3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>gsm</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/доп_ПрофилиНастроекБИТPhone.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>доп_ПрофилиНастроекБИТPhone</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>доп_АТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Манго</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UISCOM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Скорозвон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Произвольные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/доп_ТипПереводаЗвонка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>доп_ТипПереводаЗвонка</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Условный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безусловный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъединениеЛиний</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/доп_БитфонКлиент/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// Общий клиентский модуль ОЛИМП.Phone софтфон
// Содержит функции, не зависящие от конфигурации.
///////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Воспроизводит запись разговора.
// Если путь к записи - интернет-ссылка, ссылка открывается в браузере по умолчанию.
// Если путь к записи - путь к файлу:
//   - Запись воспроизводится системным проигрывателем по умолчанию, если не используется стационарный телефон.
//   - Если включен режим использования стационарного телефона, запись воспроизводится на стационарном телефоне.
//
// Параметры:
//  стрПутьКЗаписи - Строка - полное имя файла или ссылка на запись разговора.
//
Процедура ВоспроизвестиЗаписьРазговора(стрПутьКЗаписи) ЭКСПОРТ
	
	Если НЕ ЗначениеЗаполнено(стрПутьКЗаписи) Тогда
		доп_ТелефонияКлиент.ВывестиСообщение("Запись не найдена");
		Возврат;
	КонецЕсли;
	
	стрСервисЗаписейНаАТС = доп_АТСКлиент.ПутьСервисаЗаписейРазговоровНаАТС();
	
	Если Найти(стрПутьКЗаписи, стрСервисЗаписейНаАТС) = 0 Тогда
		доп_ТелефонияКлиентПереопределяемый.ЗапускПрограммы(стрПутьКЗаписи);
	Иначе
		доп_ТелефонияКлиент.ОткрытьФайлИлиСсылку(стрПутьКЗаписи);
	КонецЕсли;
	
КонецПроцедуры

// Открывает основную форму.
//
Процедура ОткрытьБитфон() ЭКСПОРТ
	доп_ТелефонияКлиент.ОткрытьФормуВыполнитьДействие(ПолучитьИмяФормыБитфона(), "", "");
КонецПроцедуры

// Открывает основную форму и начинает исходящий вызов на заданный номер.
//
// Параметры:
//  Контакт - Строка - номер телефона, также принимается ссылка на контрагента или контактное лицо.
//
Процедура ОткрытьБитфонНачатьРазговор(Контакт) ЭКСПОРТ
	доп_ТелефонияКлиентПереопределяемый.ВыбратьНомерКонтактаИОповестить(Контакт, ПолучитьИмяФормыБитфона(), "БитФон_НачатьРазговор");
КонецПроцедуры

// Возвращает имя формы ОЛИМП.Phone софтфона
// Возвращаемое значение:
//   Строка - имя формы.
Функция ПолучитьИмяФормыБитфона() ЭКСПОРТ
	Возврат "Обработка.доп_Битфон.Форма";
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Формирует полный номер телефона с префиксами выхода в город и на междугороднюю линию.
// Из номера удаляются лишние символы.
// Если номер уже с префиксами, то сначала префиксы удаляются.
//
// Параметры:
//  стрНомерИсх - Строка - номер телефона.
//
// Возвращаемое значение:
//   Строка - сформированный полный номер с префиксами, очищенный от лишних символов.
//
Функция СформироватьНомерСПрефиксами(стрНомерИсх) ЭКСПОРТ
	флагПрямойНабор		= доп_БитфонСервер.ПолучитьФлагИспользоватьПрямойНабор();
	стрПрефиксВнешЛинии	= доп_БитфонСервер.ПолучитьПрефиксВыходаНаВнешнююЛинию();
	Возврат доп_ТелефонияКлиент.СформироватьНомерСПрефиксами(стрНомерИсх, флагПрямойНабор, стрПрефиксВнешЛинии);
КонецФункции

// Возвращает имя файла для записи разговора.
// Имя файла формируется на основе текущей даты.
// Если такой файл уже существует, он удаляется.
//
// Возвращаемое значение:
//   Строка - полное имя файла (с путем).
//
Функция ПолучитьИмяФайлаДляЗаписи() ЭКСПОРТ
	стрИмяФайла = "";
	стрКаталогЗаписей = доп_БитфонСервер.ПолучитьДиректориюЗаписанныхФайлов();
	Если ЗначениеЗаполнено(стрКаталогЗаписей) Тогда
		форматФайлаЗаписи = доп_БитфонСервер.ПолучитьФорматЗаписи();
		Если форматФайлаЗаписи = ПредопределенноеЗначение("Перечисление.доп_ФорматЗаписи.gsm") Тогда
			стрРасширениеФайлаЗаписи = "wav";
		Иначе
			стрРасширениеФайлаЗаписи = Строка(форматФайлаЗаписи);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(стрРасширениеФайлаЗаписи) Тогда
			стрРасширениеФайлаЗаписи = "wav";
		КонецЕсли;
		стрИмяФайла = стрКаталогЗаписей + "\" + доп_ТелефонияКлиент.ПолучитьИмяФайлаЗаписиСДатой(ТекущаяДата()) + "." + стрРасширениеФайлаЗаписи;
	Иначе
		доп_ТелефонияКлиент.ВывестиСообщение("Не найдено значение директории для записанных файлов в настройках");
	КонецЕсли;
	Возврат стрИмяФайла;
КонецФункции

// Открывает форму настроек для текущего пользователя.
//
// Параметры:
//  Софтфон - ссылка на объект софтфона.
//
Процедура ОткрытьФормуНастроек(Софтфон) ЭКСПОРТ
	СтарыеНастройки = Новый Структура();
	СтарыеНастройки.Вставить("СобственныйНомер",		доп_БитфонСервер.ПолучитьСвойНомер());
	СтарыеНастройки.Вставить("ГлубинаИсторииЗвонков",	доп_БитфонСервер.ПолучитьГлубинуИсторииЗвонков());
	СтарыеНастройки.Вставить("УровеньЛоггирования",		доп_БитфонСервер.ПолучитьУровеньЛоггирования());
	СтарыеНастройки.Вставить("ПолучениеСтатусов",		доп_БитфонСервер.ПолучитьФлагПолучениеСтатусовАбонентов());
	СтарыеНастройки.Вставить("РежимНесколькихВход",		доп_БитфонСервер.ПолучитьФлагПриниматьНесколькоВходящих());
	СтарыеНастройки.Вставить("РазворачПриВхЗвонке",		доп_БитфонСервер.ПолучитьФлагРазворачиватьОкноПриВходящемЗвонке());
	СтарыеНастройки.Вставить("УстройствоЗвукаВхЗвонка",	доп_БитфонСервер.ПолучитьУстройствоВыводаЗвукаВходящегоЗвонка());
	СтарыеНастройки.Вставить("ТипВходящегоЗвонка",		доп_БитфонСервер.ПолучитьТипВходящегоЗвонка());
	СтарыеНастройки.Вставить("ФайлВходящегоЗвонка",		доп_БитфонСервер.ПолучитьФайлВходящегоЗвонка());
	СтарыеНастройки.Вставить("ПолучениеЗаписейСБИТАТС",	доп_БитфонСервер.ПолучитьФлагПолучатьЗаписиРазговоровСБИТАТС());
	//
	ПараметрыФормыНастроек = доп_БитфонСервер.ПолучитьПараметрыОткрытияФормыНастроек();
	//
	стрСписокУстройствВыводаЗвука = "";	// Список устройств вывода звука на компьютере,
										// разделители списка - точка с запятой,
										// элемент списка имеет вид Устройство:Драйвер.
	Если Софтфон <> Неопределено Тогда
		Попытка
			стрСписокУстройствВыводаЗвука = Софтфон.GetPlaybackDevicesList();
		Исключение
			доп_ТелефонияКлиентПереопределяемый.ПоказПредупреждение("Ошибка получения списка устройств воспроизведения звука");
		КонецПопытки;
	КонецЕсли;
	ПараметрыФормыНастроек.Вставить("СписокУстройствВывода", стрСписокУстройствВыводаЗвука);
	//
	фрмНастройки = ПолучитьФорму("РегистрСведений.доп_БитфонНастройки.Форма.ФормаЗаписиБезПользователя", ПараметрыФормыНастроек);
	фрмНастройки.Элементы.РазрешенныйАдрес.Видимость = Ложь;
	доп_ТелефонияКлиентПереопределяемый.ОткрытьФормуСБлокировкойВладельца(фрмНастройки, "БитФон_ОбновлениеНастроек", СтарыеНастройки);
КонецПроцедуры

// Отправляет по электронной почте письмо в техподдержку.
// В приложении к письму добавляется архив с лог-файлами.
//
Процедура ОтправитьЗапросВТехподдержкуСАрхивомЛога() ЭКСПОРТ
	фрмОтправкаЗапроса = ПолучитьФорму("Обработка.доп_Битфон.Форма.ОтправкаЗапросаВТехподдержку");
	доп_ТелефонияКлиентПереопределяемый.ОткрытьФормуСБлокировкойВладельца(фрмОтправкаЗапроса);
КонецПроцедуры

//
// Работа с ВК софтфона
//

// Подключает внешнюю компоненту софтфона.
// При необходимости компонента устанавливается.
//
Процедура ПодключитьСофтфон(ИмяОповещения, ПараметрОповещения=Неопределено) ЭКСПОРТ
#Если ВебКлиент Тогда
	доп_ТелефонияКлиент.ВывестиСообщение("Работа софтфона в режиме веб-клиента не поддерживается");
	Возврат;
#КонецЕсли
	Попытка
		стрИмяФайлаВК = ? ( доп_ТелефонияКлиент.Клиент64бит(), "NativeSoftPhone64.dll", "NativeSoftPhone.dll");
		доп_ТелефонияКлиентПереопределяемый.ПодключениеВнешнейКомпоненты(
								"ОбщийМакет.доп_Софтфон",
								стрИмяФайлаВК,
								"доп_БитфонСервер",
								"SoftPhoneNative",
								"ОЛИМП.Phone",
								ИмяОповещения,
								ПараметрОповещения);
	Исключение
		доп_ТелефонияКлиент.ВывестиСообщение(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

// Проверка возможности подключения к внешнему ресурсу.
//
// Параметры:
//  стрИмяСобытия - Строка, имя события для оповещения продолжения подключения.
//
// Возвращаемое значение:
//   Булево - флаг успешности проверки.
//
Функция ПроверкаРазрешенногоАдреса(Софтфон, стрИмяСобытия) ЭКСПОРТ
	стрРазрешенныйАдрес = доп_БитфонСервер.ПолучитьРазрешенныйАдрес();
	стрАдресПодключения = доп_БитфонСервер.ПолучитьПараметрыСоединения().АдресСервера;
	Если стрРазрешенныйАдрес = стрАдресПодключения Тогда
		Возврат ИнициализироватьСофтфонРегистрацияНаАТС(Софтфон);
	Иначе
		стрЗапросНовогоПодключения = "Разрешить подключение к АТС по адресу '" + стрАдресПодключения + "'?";
		доп_ТелефонияКлиентПереопределяемый.ПоказВопрос(стрЗапросНовогоПодключения,
			РежимДиалогаВопрос.ДаНет, , , , стрИмяСобытия, стрАдресПодключения);
		Возврат Ложь;
	КонецЕсли;
КонецФункции

// Начальная инициализация объекта софтфона и регистрация на АТС.
//
// Параметры:
//  Софтфон - ссылка на объект софтфона.
//
// Возвращаемое значение:
//   Булево - флаг успешности инициализации.
//
Функция ИнициализироватьСофтфонРегистрацияНаАТС(Софтфон) ЭКСПОРТ
	
	Если Софтфон = Неопределено Тогда
		доп_ТелефонияКлиент.ВывестиСообщение("ОЛИМП.Phone - Ошибка! Не создан объект Софтфона.");
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыСоединения = доп_БитфонСервер.ПолучитьПараметрыСоединения();
	
	серверЛицензийВерсия		= доп_БитфонСервер.ПолучитьВерсиюСервераЛицензий();
	стрСерверЛицензийАдрес		= доп_БитфонСервер.ПолучитьАдресСервераЛицензий();
	серверЛицензийПорт			= доп_БитфонСервер.ПолучитьПортСервераЛицензий();
	серверЛицензийНеИспПрокси	= доп_БитфонСервер.ПолучитьФлагСервераЛицензийНеИспользоватьПрокси();
	уровеньЛоггирования			= доп_БитфонСервер.ПолучитьУровеньЛоггирования();
	стрСерверЛицензийCID		= доп_БитфонСервер.ПолучитьCIDСервераЛицензий();
	стрСерверЛицензийПутьКоннектора	= доп_ТелефонияКлиент.ПолучитьПутьБиблиотекиКоннектораСЛ(серверЛицензийВерсия, Истина);
	
	Попытка
		ИнициализацияУспешна = Софтфон.Init(уровеньЛоггирования, ПараметрыСоединения.Логин, ПараметрыСоединения.RTPПорт,
										ПараметрыСоединения.ДетекторАктивностиМикрофона,
										стрСерверЛицензийАдрес, серверЛицензийПорт, серверЛицензийНеИспПрокси,
										серверЛицензийВерсия, стрСерверЛицензийПутьКоннектора, стрСерверЛицензийCID);
		Если НЕ ИнициализацияУспешна Тогда
			доп_ТелефонияКлиент.ВывестиСообщение("ОЛИМП.Phone - Ошибка! Не удалось инициализировать Софтфон.");
			Возврат Ложь;
		КонецЕсли;
	Исключение
		доп_ТелефонияКлиент.ВывестиСообщение("ОЛИМП.Phone - Ошибка! Не удалось инициализировать Софтфон. Исключение: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Попытка
		списокКодеков = доп_БитфонСервер.ПолучитьСписокКодеков();
		Если НЕ ЗначениеЗаполнено(списокКодеков) Тогда
			списокКодеков = Софтфон.GetCodecs();
			
			// UISCOM
			Если доп_БитфонСервер.ПолучитьПрофильНастроек() = ПредопределенноеЗначение("Перечисление.доп_ПрофилиНастроекБИТPhone.UISCOM") Тогда
				списокКодеков = УстановкаПриоритетаКодекаPCMA(списокКодеков, 131);
			КонецЕсли;
			
			доп_БитфонСервер.УстановитьСписокКодеков(списокКодеков);
		КонецЕсли;
		
		массКодеков = РазобратьСписокКодеков(списокКодеков);
		Для Каждого кодекПриор Из массКодеков Цикл
			Софтфон.SetCodecPriority(кодекПриор.Кодек, кодекПриор.Приоритет);
		КонецЦикла;
	Исключение
		доп_ТелефонияКлиент.ВывестиСообщение("ОЛИМП.Phone - Ошибка! Не удалось установить список кодеков. Исключение: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	многоканальныйРежим = доп_БитфонСервер.ПолучитьФлагПриниматьНесколькоВходящих();
	Попытка
		Софтфон.SetMultichannelMode(многоканальныйРежим);
	Исключение
		доп_ТелефонияКлиент.ВывестиСообщение("ОЛИМП.Phone - Ошибка! Не удалось установить режим многоканальности. Исключение: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	разворачиватьПриВходящемЗвонке = доп_БитфонСервер.ПолучитьФлагРазворачиватьОкноПриВходящемЗвонке();
	Попытка
		Софтфон.SetActivateOnIncomingCall(разворачиватьПриВходящемЗвонке);
	Исключение
		доп_ТелефонияКлиент.ВывестиСообщение("ОЛИМП.Phone - Ошибка! Не удалось установить флаг разворачивания окна при входящем звонке. Исключение: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	устройствоВыводаЗвукаВходящегоЗвонка = доп_БитфонСервер.ПолучитьУстройствоВыводаЗвукаВходящегоЗвонка();
	Если ЗначениеЗаполнено(устройствоВыводаЗвукаВходящегоЗвонка) Тогда
		Попытка
			Софтфон.SetRingPlaybackDevice(устройствоВыводаЗвукаВходящегоЗвонка);
		Исключение
			доп_ТелефонияКлиент.ВывестиСообщение("ОЛИМП.Phone - Ошибка! Не удалось задать устройство вывода звука " +
				устройствоВыводаЗвукаВходящегоЗвонка + " для входящего звонка. Исключение: " + ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	типВходящегоЗвонка = доп_БитфонСервер.ПолучитьТипВходящегоЗвонка();
	Если типВходящегоЗвонка <> 0 Тогда
		стрФайлВходящегоЗвонка = доп_БитфонСервер.ПолучитьФайлВходящегоЗвонка();
		Попытка
			Софтфон.SetRingType(типВходящегоЗвонка, стрФайлВходящегоЗвонка);
		Исключение
			доп_ТелефонияКлиент.ВывестиСообщение("ОЛИМП.Phone - Ошибка! Не удалось задать тип входящего звонка. Исключение: " + ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ПустаяСтрока(ПараметрыСоединения.Логин) Тогда
		доп_ТелефонияКлиент.ВывестиСообщение("ОЛИМП.Phone - Ошибка! Получить параметры соединения не удалось");
		Возврат Ложь;
	КонецЕсли;
	
	СвойНомер = доп_БитфонСервер.ПолучитьСвойНомер();
	Если ПустаяСтрока(СвойНомер) Тогда
		доп_ТелефонияКлиент.ВывестиСообщение("ОЛИМП.Phone - Ошибка! Не задан свой номер в настройках");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		СофтФон.Register(ПараметрыСоединения.Логин, ПараметрыСоединения.АдресСервера, ПараметрыСоединения.АдресПрокси,
			ПараметрыСоединения.CallerID, ПараметрыСоединения.IDАвторизации, ПараметрыСоединения.Пароль,
			Строка(ПараметрыСоединения.Протокол), ПараметрыСоединения.ИнтервалПеререгистрации, ПараметрыСоединения.АвтоопределениеNAT);
	Исключение
		доп_ТелефонияКлиент.ВывестиСообщение("ОЛИМП.Phone - Ошибка! Не удалось зарегистрироваться на АТС. " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

	Возврат Истина;
КонецФункции

// Обработчик изменения профиля настроек.
//
// Параметры:
//  Запись - ссылка запись регистра сведений настроек.
//  флагВыводитьСообщения - Булево, Истина для вывода сообщений при изменении настроек.
//
Процедура ОбработчикИзмененияПрофиляНастроек(Запись, флагВыводитьСообщения) ЭКСПОРТ
	
	стрАдресСервераПоУмолчаниюМанго = "mangosip.ru";
	стрАдресСервераПоУмолчаниюUISCOM = "voip.uiscom.ru:9060";
	стрАдресСервераПоУмолчаниюСкорозвон = "31.186.102.42";
	
	соотвСписокСерверов = Новый Соответствие();
	соотвСписокСерверов.Вставить(стрАдресСервераПоУмолчаниюМанго, "");
	соотвСписокСерверов.Вставить(стрАдресСервераПоУмолчаниюUISCOM, "");
	соотвСписокСерверов.Вставить(стрАдресСервераПоУмолчаниюСкорозвон, "");
	
	ключСервер = соотвСписокСерверов.Получить(Запись.АдресСервера);
	
	//
	Если Запись.ПрофильНастроек = ПредопределенноеЗначение("Перечисление.доп_ПрофилиНастроекБИТPhone.Манго") Тогда
		Если (НЕ ЗначениеЗаполнено(Запись.АдресСервера))
			ИЛИ (ключСервер <> Неопределено)
		Тогда
			Запись.АдресСервера = стрАдресСервераПоУмолчаниюМанго;
		КонецЕсли;
	КонецЕсли;
	
	//
	Если Запись.ПрофильНастроек = ПредопределенноеЗначение("Перечисление.доп_ПрофилиНастроекБИТPhone.UISCOM") Тогда
		Если (НЕ ЗначениеЗаполнено(Запись.АдресСервера))
			ИЛИ (ключСервер <> Неопределено)
		Тогда
			Запись.АдресСервера = стрАдресСервераПоУмолчаниюUISCOM;
		КонецЕсли;
		
		Запись.RTPПорт = 10000;
		Запись.СписокКодеков = УстановкаПриоритетаКодекаPCMA(Запись.СписокКодеков, 131);
	Иначе
		Запись.RTPПорт						= доп_БитфонСервер.ПолучитьRTPПортПоУмолчанию();
		Запись.СписокКодеков				= УстановкаПриоритетаКодекаPCMA(Запись.СписокКодеков, 128);
	КонецЕсли;
	
	//
	Если Запись.ПрофильНастроек = ПредопределенноеЗначение("Перечисление.доп_ПрофилиНастроекБИТPhone.Скорозвон") Тогда
		Если (НЕ ЗначениеЗаполнено(Запись.АдресСервера))
			ИЛИ (ключСервер <> Неопределено)
		Тогда
			Запись.АдресСервера = стрАдресСервераПоУмолчаниюСкорозвон;
		КонецЕсли;
		
		Запись.АвтоопределениеNAT	= Ложь;
		Запись.АдресПрокси = "31.186.102.42:5020";
	Иначе
		Запись.АвтоопределениеNAT	= доп_БитфонСервер.ПолучитьФлагАвтоопределениеNATПоУмолчанию();
		Запись.АдресПрокси = "";
	КонецЕсли;
	
	// общие параметры для нескольких профилей
	Запись.ПрефиксВыходаНаВнешнююЛинию = ПолучитьПрефиксВыходаНаВнешнююЛиниюПрофиля(Запись.ПрофильНастроек);
	
	// настройки для ОЛИМП.АТС и произвольные
	Если (Запись.ПрофильНастроек = ПредопределенноеЗначение("Перечисление.доп_ПрофилиНастроекБИТPhone.доп_АТС"))
		ИЛИ (Запись.ПрофильНастроек = ПредопределенноеЗначение("Перечисление.доп_ПрофилиНастроекБИТPhone.Произвольные"))
	Тогда
		Если ключСервер <> Неопределено Тогда
			Запись.АдресСервера = "";
		КонецЕсли;
	Иначе
		Если Запись.ТипПереводаЗвонка = ПредопределенноеЗначение("Перечисление.доп_ТипПереводаЗвонка.Условный") Тогда
			Если флагВыводитьСообщения Тогда
				доп_ТелефонияКлиент.ВывестиСообщение("Условный тип перевода доступен только при использовании ОЛИМП.АТС, изменен на безусловный");
			КонецЕсли;
			Запись.ТипПереводаЗвонка = ПредопределенноеЗначение("Перечисление.доп_ТипПереводаЗвонка.Безусловный");
		КонецЕсли;
		//
		Если Запись.ИспользоватьКомандуНеБеспокоитьНаАТС Тогда
			Если флагВыводитьСообщения Тогда
				доп_ТелефонияКлиент.ВывестиСообщение("Команда 'Не беспокоить' на АТС доступна только при использовании ОЛИМП.АТС, отключена");
			КонецЕсли;
			Запись.ИспользоватьКомандуНеБеспокоитьНаАТС = Ложь;
		КонецЕсли;
		//
		Если Запись.ПолучатьЗаписиРазговоровСБИТАТС Тогда
			Если флагВыводитьСообщения Тогда
				доп_ТелефонияКлиент.ВывестиСообщение("Получение записей разговоров возможно только с ОЛИМП.АТС, отключено");
			КонецЕсли;
			Запись.ПолучатьЗаписиРазговоровСБИТАТС = Ложь;
		КонецЕсли;
		//
		Если Запись.ПроверкаСтатусаНомераПередПереводом Тогда
			Если флагВыводитьСообщения Тогда
				доп_ТелефонияКлиент.ВывестиСообщение("Проверка статуса номера перед переводом возможна только с ОЛИМП.АТС, отключена");
			КонецЕсли;
			Запись.ПроверкаСтатусаНомераПередПереводом = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Разбор строки со списком кодеков.
//
// Параметры:
//  стрСписокКодеков - Строка, список кодеков в формате 'кодек1=приоритет1;кодек1=приоритет2;...'.
//
// Возвращаемое значение:
//  массив структур с полями
//    Кодек - Строка,
//    Приоритет - Число.
//
Функция РазобратьСписокКодеков(стрСписокКодеков) ЭКСПОРТ
	массКодеки = Новый Массив;
	
	списокСПриоритетом = доп_ТелефонияКлиентСервер.СтрРазбить(стрСписокКодеков, ";");
	Для Каждого кодекПриорЭл Из списокСПриоритетом Цикл
		стрКодекПриор = кодекПриорЭл.Значение;
		индекс = Найти(стрКодекПриор, "=");
		Если индекс > 0 Тогда
			стрКодек = Лев(стрКодекПриор, индекс-1);
			стрПриор = Сред(стрКодекПриор, индекс+1);
			приор = Число(стрПриор);
			структКодекПриор = Новый Структура();
			структКодекПриор.Вставить("Кодек", стрКодек);
			структКодекПриор.Вставить("Приоритет", приор);
			массКодеки.Добавить(структКодекПриор);
		КонецЕсли;
	КонецЦикла;
	
	Возврат массКодеки;
КонецФункции

//-----------------------------------------------------------------------------
// Коды картинок статусов:
// 0 - не найден
// 1 - свободен
// 2 - разговаривает
// 3 - не доступен
// 4 - ожидание
Функция ПолучитьИндексКартинкиСтатуса(СтатусНомера, ОписаниеСтатуса) ЭКСПОРТ
	ИндексКартинкиСтатуса = 0;
	Если СтатусНомера = 0 Тогда
		ИндексКартинкиСтатуса = 0;
	ИначеЕсли СтатусНомера = 2 Тогда
		ИндексКартинкиСтатуса = 3;
	ИначеЕсли СтатусНомера = 1 Тогда
		Если ОписаниеСтатуса = "On hold" Тогда
			ИндексКартинкиСтатуса = 4;
		ИначеЕсли ОписаниеСтатуса = "On the phone" Тогда
			ИндексКартинкиСтатуса = 2;
		ИначеЕсли ОписаниеСтатуса = "Ready" Тогда
			ИндексКартинкиСтатуса = 1;
		КонецЕсли;
	КонецЕсли;
	Возврат ИндексКартинкиСтатуса;
КонецФункции

Функция ПолучитьОписаниеСтатусаПоИндексуКартинки(ИндексКартинкиСтатуса) ЭКСПОРТ
	СтрокаСтатуса = "";
	Если ИндексКартинкиСтатуса = 0 Тогда
		СтрокаСтатуса = "не найден";
	ИначеЕсли ИндексКартинкиСтатуса = 1 Тогда
		СтрокаСтатуса = "свободен";
	ИначеЕсли ИндексКартинкиСтатуса = 2 Тогда
		СтрокаСтатуса = "разговаривает";
	ИначеЕсли ИндексКартинкиСтатуса = 3 Тогда
		СтрокаСтатуса = "не доступен";
	ИначеЕсли ИндексКартинкиСтатуса = 4 Тогда
		СтрокаСтатуса = "ожидание";
	КонецЕсли;
	Возврат СтрокаСтатуса;
КонецФункции

//
// Работа с ВК управления АТС
//

Функция ПолучитьЗаписьРазговораБИТАТС(обКонтроллерАТС, стрСвойНомер, стрНомерАбонента) ЭКСПОРТ
	
	Если обКонтроллерАТС = Неопределено Тогда
		доп_ТелефонияКлиент.ВывестиСообщение("Не создан объект управления ОЛИМП.АТС");
		Возврат "";
	КонецЕсли;
	
	стрЗаписьРазговораБИТАТС = "";
	
	Попытка
		
		СИПЛогинСофтфон = доп_БитфонСервер.ПолучитьПараметрыСоединения().Логин;
		
		ТекущаяАТС = доп_БитфонСервер.ПолучитьАТС();
		
		Если НЕ ЗначениеЗаполнено(ТекущаяАТС) Тогда
			доп_ТелефонияКлиент.ВывестиСообщение("Не задана ОЛИМП.АТС для получения записей разговоров в настройках");
			Возврат "";
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(стрСвойНомер) Тогда
			доп_ТелефонияКлиент.ВывестиСообщение("Не задан свой номер телефона для получения записей разговоров");
			Возврат "";
		КонецЕсли;
		
		Хост = доп_АТССервер.ПолучитьПараметрыПодключенияАТС(ТекущаяАТС);
		
		ХэшЗаписи = обКонтроллерАТС.GetExtensionRecordHash(Хост.Адрес, Хост.Пользователь, Хост.Пароль, стрСвойНомер, СИПЛогинСофтфон);
		Если ЗначениеЗаполнено(ХэшЗаписи) Тогда
			стрЗаписьРазговораБИТАТС = доп_АТСКлиент.СформироватьСсылкуНаЗаписьРазговора(Хост.Адрес, ХэшЗаписи);
		КонецЕсли;
		
	Исключение
		
		доп_ТелефонияКлиент.ВывестиСообщение("Ошибка получения записи разговора с ОЛИМП.АТС '" + Строка(ТекущаяАТС) + "'");
		доп_ТелефонияКлиент.ВывестиСообщение(ОписаниеОшибки());
	
	КонецПопытки;
	
	//
	
	Попытка
		Если обКонтроллерАТС.IsConnected Тогда
			обКонтроллерАТС.Disconnect();
		КонецЕсли;
	Исключение
		доп_ТелефонияКлиент.ВывестиСообщение("Ошибка отключения от ОЛИМП.АТС '" + Строка(ТекущаяАТС) + "'");
		доп_ТелефонияКлиент.ВывестиСообщение(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат стрЗаписьРазговораБИТАТС;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УстановкаПриоритетаКодекаPCMA(стрСписокКодеков, приоритет)
	массКодеков = РазобратьСписокКодеков(стрСписокКодеков);
	Для Каждого кодекПриор Из массКодеков Цикл
		Если Найти(кодекПриор.Кодек, "PCMA") > 0 Тогда
			кодекПриор.Приоритет = приоритет;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	стрСписокКодеков = "";
	Для Каждого кодекПриор Из массКодеков Цикл
		стрКодек = кодекПриор.Кодек;
		стрПриор = Строка(кодекПриор.Приоритет);
		стрСписокКодеков = стрСписокКодеков + стрКодек + "=" + стрПриор + ";";
	КонецЦикла;
	Возврат стрСписокКодеков;
КонецФункции

Функция ПолучитьПрефиксВыходаНаВнешнююЛиниюПрофиля(профильНастроек)
	стрПрефикс = "";
	Если профильНастроек = ПредопределенноеЗначение("Перечисление.доп_ПрофилиНастроекБИТPhone.UISCOM") ИЛИ
		профильНастроек = ПредопределенноеЗначение("Перечисление.доп_ПрофилиНастроекБИТPhone.Скорозвон")
	Тогда
		стрПрефикс = "";
	Иначе
		стрПрефикс = доп_ТелефонияСервер.ПолучитьПрефиксВыходаНаВнешнююЛиниюПоУмолчанию();	
	КонецЕсли;
	Возврат стрПрефикс;
КонецФункции

#КонецОбласти
